# MaterialId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MaterialNode..::..MaterialId Property
MaterialNode Class See Also
---
The Id of the element assocated with this material in the model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId MaterialId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MaterialId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ MaterialId {
	ElementId^ get ();
}
```

# Remarks
It is possible that no specific material is applied to a face, in which case the default material is used, and this property returns an InvalidElementId.
# See Also
MaterialNode Class
Autodesk.Revit.DB Namespace